In [1]:
# import
import pandas as pd

In [2]:
df = pd.read_csv(r'../Datasets/realtor-data.zip.csv')
df.head(5)

,status,bed,bath,acre_lot,city,state,zip_code,house_size,prev_sold_date,price
0,for_sale,3.0,2.0,0.12,Adjuntas,Puerto Rico,601.0,920.0,NaN,105000.0
1,for_sale,4.0,2.0,0.08,Adjuntas,Puerto Rico,601.0,1527.0,NaN,80000.0
2,for_sale,2.0,1.0,0.15,Juana Diaz,Puerto Rico,795.0,748.0,NaN,67000.0
3,for_sale,4.0,2.0,0.10,Ponce,Puerto Rico,731.0,1800.0,NaN,145000.0
4,for_sale,6.0,2.0,0.05,Mayaguez,Puerto Rico,680.0,NaN,NaN,65000.0

In [3]:
#  Hər bir sütunda olan kateqorik dəyərlərin unique sayını taparaq hansının kateqoriya olduğunu təsbit edin
df_d = df.select_dtypes(exclude=['int', 'float'])
for col in df_d.columns:
    print(df_d[col].unique()) 
    print(df_d[col].value_counts())

['for_sale' 'ready_to_build']
status
for_sale          1399134
ready_to_build       1932
Name: count, dtype: int64
['Adjuntas' 'Juana Diaz' 'Ponce' ... 'Mount Morris' 'East Concord'
 'Brocton']
city
New York City      61299
New York           55543
Brooklyn           33491
Boston             31551
Bronx              22666
                   ...
Carversville           1
Furlong                1
Sangerville            1
Willow Grove           1
Northeast Carry        1
Name: count, Length: 3512, dtype: int64
['Puerto Rico' 'Virgin Islands' 'Massachusetts' 'Connecticut'
 'New Hampshire' 'Vermont' 'New Jersey' 'New York' 'South Carolina'
 'Tennessee' 'Rhode Island' 'Virginia' 'Wyoming' 'Maine' 'Georgia'
 'Pennsylvania' 'West Virginia' 'Delaware' 'Louisiana']
state
New York          653061
New Jersey        256551
Massachusetts     177170
Connecticut        98816
New Hampshire      51394
Vermont            48230
Maine              36650
Rhode Island       29610
Puerto Rico        24679
Pennsylvania       20060
Virgin Islands      2573
Delaware            2135
Georgia               50
Virginia              31
South Carolina        25
Tennessee             20
West Virginia          5
Wyoming                3
Louisiana              3
Name: count, dtype: int64
[nan '2020-02-28' '2019-06-28' ... '2018-11-03' '1998-08-04' '2020-12-05']
prev_sold_date
2022-04-15    734
2022-02-28    554
2022-03-31    516
2021-10-13    478
2022-01-21    433
             ...
2002-03-23      1
1977-05-03      1
1985-04-09      1
1983-05-16      1
2020-12-05      1
Name: count, Length: 10319, dtype: int64

In [4]:
# Nulların sayını tapın
null_counts = df.isnull().sum()
print(null_counts)

status                 0
bed               216528
bath              194213
acre_lot          357467
city                 191
state                  0
zip_code             479
house_size        450112
prev_sold_date    686293
price                108
dtype: int64

In [7]:
# Dublikatları təmizləyin
duplicat = df.drop_duplicates()
print(duplicat)

           status   bed  bath  acre_lot         city        state  zip_code  \
0        for_sale   3.0   2.0      0.12     Adjuntas  Puerto Rico     601.0
1        for_sale   4.0   2.0      0.08     Adjuntas  Puerto Rico     601.0
2        for_sale   2.0   1.0      0.15   Juana Diaz  Puerto Rico     795.0
3        for_sale   4.0   2.0      0.10        Ponce  Puerto Rico     731.0
4        for_sale   6.0   2.0      0.05     Mayaguez  Puerto Rico     680.0
...           ...   ...   ...       ...          ...          ...       ...
1401002  for_sale   3.0   2.0      0.22   Friendship     New York   14739.0
1401048  for_sale   1.0   1.0      0.25  Forestville     New York   14062.0
1401058  for_sale   3.0   2.0      3.00        Gerry     New York   14740.0
1401059  for_sale   5.0   2.0      0.55      Brocton     New York   14716.0
1401063  for_sale  10.0   4.0      0.43      Brocton     New York   14716.0

         house_size prev_sold_date     price
0             920.0            NaN  105000.0
1            1527.0            NaN   80000.0
2             748.0            NaN   67000.0
3            1800.0            NaN  145000.0
4               NaN            NaN   65000.0
...             ...            ...       ...
1401002       532.0     2004-06-22  118500.0
1401048       696.0            NaN  139000.0
1401058      1568.0     1999-12-27  189900.0
1401059      4260.0            NaN   95000.0
1401063      4802.0     1994-12-01  120000.0

[152040 rows x 10 columns]

In [5]:
# Təsbit etdiyiniz kateqorik sütununun sayını, std və ortalamasını tapın

NameError: name 'duplicat' is not defined